function initData() {
  const charts = {
    linesData: [
      //===========表箱1和3中间点和表箱2连接线=========
      {
        remark: "表箱2上方点 => 表箱1和表箱3中间点",
        coords: [
          [368, 750],
          [718, 750],
        ],
      },
      {
        remark: "表箱2上方点 => 表箱2竖线",
        coords: [
          [370, 750],
          [370, 660],
        ],
      },

      //==============表箱1-3中间点 和表箱3连接线==================
      {
        remark: "表箱1和表箱3中间 => 表箱3开关",
        coords: [
          [718, 750],
          [718, 660],
        ],
      },
      {
        remark: "表箱1和表箱3中间 => 表箱1开关",
        coords: [
          [718, 750],
          [718, 835],
        ],
      },
      //====================分支开关1接表箱2=============
      {
        remark: "表箱1和表箱3中间 => 表箱3和低压分支箱上方中间点",
        coords: [
          [718, 750],
          [902, 750],
        ],
      },
      {
        remark: "表箱3和低压分支箱上方中间点 => 表箱3和低压分支箱下方中间点",
        coords: [
          [900, 750],
          [900, 408],
        ],
      },
      {
        remark: "表箱3和低压分支箱下方中间点 => 分支开关1下方点",
        coords: [
          [900, 408],
          [1097, 408],
        ],
      },
      {
        remark: "分支开关1下方点 => 分支开关1",
        coords: [
          [1095, 408],
          [1095, 490],
        ],
      },
      //============低压分支箱连线===============
      {
        remark: "低压分支箱中间点 => 分支开关2",
        coords: [
          [1313, 635],
          [1313, 535],
        ],
      },
      {
        remark: "分支开关1 => 开关1上方点",
        coords: [
          [1095, 535],
          [1095, 632],
        ],
      },
      {
        remark: "分支开关3 => 开关3上方点",
        coords: [
          [1531, 535],
          [1531, 632],
        ],
      },
      {
        remark: "开关1上方点 => 开关3上方点",
        coords: [
          [1095, 632],
          [1531, 632],
        ],
      },
      {
        remark: "分支开关中间点 => 总开关",
        coords: [
          [1313, 632],
          [1313, 673],
        ],
      },
      {
        remark: "分支开关2 => 下方点",
        coords: [
          [1313, 488],
          [1313, 375],
        ],
      },
      {
        remark: "分支开关3 => 下方点",
        coords: [
          [1531, 488],
          [1531, 375],
        ],
      },
      //=================低压配电室======================
      {
        remark: "分支总开关 => 低压配电室开关",
        coords: [
          [1313, 720],
          [1313, 905],
        ],
      },
      //==============表箱1连接线== 中间和电表间距28====电表和电表间距70===============
      {
        remark: "表箱1开关 => 上方点",
        coords: [
          [718, 880],
          [718, 920],
        ],
      },
      {
        remark: "上方点 => 电表2下方",
        coords: [
          [718, 920],
          [690, 920],
        ],
      },
      {
        remark: "电表2下方 => 电表2",
        coords: [
          [690, 920],
          [690, 950],
        ],
      },
      {
        remark: "电表2下方 => 电表1下方",
        coords: [
          [690, 920],
          [618, 920],
        ],
      },
      {
        remark: "电表1下方 => 电表1",
        coords: [
          [620, 920],
          [620, 950],
        ],
      },
      {
        remark: "上方点 => 电表3下方",
        coords: [
          [718, 920],
          [746, 920],
        ],
      },
      {
        remark: "电表3下方 => 电表3",
        coords: [
          [746, 920],
          [746, 950],
        ],
      },
      {
        remark: "电表3下方 => 电表4下方",
        coords: [
          [746, 920],
          [818, 920],
        ],
      },
      {
        remark: "电表4下方 => 电表4",
        coords: [
          [816, 920],
          [816, 950],
        ],
      },
      //====================表箱2连线========中间和电表间距28====电表和电表间距70======================
      {
        remark: "表箱2开关 => 下方中间点",
        coords: [
          [370, 618],
          [370, 570],
        ],
      },
      {
        remark: "下方中间点 => 电表2上方",
        coords: [
          [370, 570],
          [335, 570],
        ],
      },
      {
        remark: "电表2上方 => 电表2",
        coords: [
          [335, 570],
          [335, 525],
        ],
      },
      {
        remark: "下方中间点 => 电表3上方",
        coords: [
          [370, 570],
          [398, 570],
        ],
      },
      {
        remark: "电表3上方 => 电表3",
        coords: [
          [398, 570],
          [398, 525],
        ],
      },
      {
        remark: "电表2上方 => 电表1上方",
        coords: [
          [342, 570],
          [266, 570],
        ],
      },
      {
        remark: "电表1上方 => 电表1",
        coords: [
          [268, 570],
          [268, 525],
        ],
      },
      {
        remark: "电表3上方 => 电表4上方",
        coords: [
          [398, 570],
          [470, 570],
        ],
      },
      {
        remark: "电表4上方 => 电表4",
        coords: [
          [468, 570],
          [468, 525],
        ],
      },
      //==========================表箱3连线=========中间和电表间距28====电表和电表间距70==================================
      {
        remark: "表箱3开关 => 下方中间点",
        coords: [
          [718, 618],
          [718, 570],
        ],
      },
      {
        remark: "下方中间点 => 电表2上方",
        coords: [
          [718, 570],
          [683, 570],
        ],
      },
      {
        remark: "电表2上方 => 电表2",
        coords: [
          [683, 570],
          [683, 525],
        ],
      },
      {
        remark: "下方中间点 => 电表3上方",
        coords: [
          [718, 570],
          [746, 570],
        ],
      },
      {
        remark: "电表3上方 => 电表3",
        coords: [
          [746, 570],
          [746, 525],
        ],
      },
      {
        remark: "电表2上方 => 电表1上方",
        coords: [
          [683, 570],
          [618, 570],
        ],
      },
      {
        remark: "电表1上方 => 电表1",
        coords: [
          [620, 570],
          [620, 525],
        ],
      },
      {
        remark: "电表3上方 => 电表4上方",
        coords: [
          [746, 570],
          [818, 570],
        ],
      },
      {
        remark: "电表4上方 => 电表4",
        coords: [
          [816, 570],
          [816, 525],
        ],
      },
      //=============分支开关2下方点 => 表箱6上方点 => 表箱6开关 =>电表连线==============================
      {
        remark: "分支开关2下方点 => 表箱6上方点",
        coords: [
          [1315, 375],
          [1063, 375],
        ],
      },
      {
        remark: "表箱6上方点 => 表箱6开关",
        coords: [
          [1065, 375],
          [1065, 298],
        ],
      },
      {
        remark: "表箱6开关 => 下方中间点",
        coords: [
          [1065, 250],
          [1065, 200],
        ],
      },
      {
        remark: "下方中间点 => 电表2上方",
        coords: [
          [1067, 200],
          [1028, 200],
        ],
      },
      {
        remark: "电表2上方 => 电表2",
        coords: [
          [1030, 200],
          [1030, 158],
        ],
      },
      {
        remark: "电表2上方 => 电表1上方",
        coords: [
          [1030, 200],
          [963, 200],
        ],
      },
      {
        remark: "电表1上方 => 电表1",
        coords: [
          [965, 200],
          [965, 158],
        ],
      },
      {
        remark: "下方中间点 => 电表3上方",
        coords: [
          [1067, 200],
          [1096, 200],
        ],
      },
      {
        remark: "电表3上方 => 电表3",
        coords: [
          [1094, 200],
          [1094, 158],
        ],
      },
      {
        remark: "电表3上方 => 电表4上方",
        coords: [
          [1094, 200],
          [1163, 200],
        ],
      },
      {
        remark: "电表4上方 => 电表4",
        coords: [
          [1161, 200],
          [1161, 158],
        ],
      },
      //=============表箱6上方点 => 表箱5上方点 => 表箱5开关 => 电表连线==============================
      {
        remark: "表箱6上方点 => 表箱5上方点",
        coords: [
          [1063, 375],
          [717, 375],
        ],
      },
      {
        remark: "表箱5上方点 => 表箱5开关",
        coords: [
          [719, 375],
          [719, 298],
        ],
      },
      {
        remark: "表箱5开关 => 下方中间点",
        coords: [
          [719, 250],
          [719, 200],
        ],
      },
      {
        remark: "下方中间点 => 电表2上方",
        coords: [
          [719, 200],
          [685, 200],
        ],
      },
      {
        remark: "电表2上方 => 电表2",
        coords: [
          [685, 200],
          [685, 158],
        ],
      },
      {
        remark: "电表2上方 => 电表1上方",
        coords: [
          [685, 200],
          [620, 200],
        ],
      },
      {
        remark: "电表1上方 => 电表1",
        coords: [
          [622, 200],
          [622, 158],
        ],
      },
      {
        remark: "下方中间点 => 电表3上方",
        coords: [
          [719, 200],
          [748, 200],
        ],
      },
      {
        remark: "电表3上方 => 电表3",
        coords: [
          [748, 200],
          [748, 158],
        ],
      },
      {
        remark: "电表3上方 => 电表4上方",
        coords: [
          [748, 200],
          [815, 200],
        ],
      },
      {
        remark: "电表4上方 => 电表4",
        coords: [
          [813, 200],
          [813, 158],
        ],
      },
      //=============表箱5上方点 => 表箱4上方点 => 表箱4开关==============================
      {
        remark: "表箱5上方点 => 表箱4上方点",
        coords: [
          [717, 375],
          [368, 375],
        ],
      },
      {
        remark: "表箱4上方点 => 表箱4开关",
        coords: [
          [370, 375],
          [370, 298],
        ],
      },
      {
        remark: "表箱4开关 => 下方中间点",
        coords: [
          [370, 250],
          [370, 200],
        ],
      },
      {
        remark: "下方中间点 => 电表2上方",
        coords: [
          [370, 200],
          [335, 200],
        ],
      },
      {
        remark: "电表2上方 => 电表2",
        coords: [
          [335, 200],
          [335, 158],
        ],
      },
      {
        remark: "电表2上方 => 电表1上方",
        coords: [
          [335, 200],
          [271, 200],
        ],
      },
      {
        remark: "电表1上方 => 电表1",
        coords: [
          [273, 200],
          [273, 158],
        ],
      },
      {
        remark: "下方中间点 => 电表3上方",
        coords: [
          [370, 200],
          [400, 200],
        ],
      },
      {
        remark: "电表3上方 => 电表3",
        coords: [
          [400, 200],
          [400, 158],
        ],
      },
      {
        remark: "电表3上方 => 电表4上方",
        coords: [
          [400, 200],
          [467, 200],
        ],
      },
      {
        remark: "电表4上方 => 电表4",
        coords: [
          [465, 200],
          [465, 158],
        ],
      },
      //=============分支开关3下方点  => 表箱7开关 =>电表连线 ==============================
      {
        remark: "分支开关3下方点 => 表箱7开关",
        coords: [
          [1531, 375],
          [1531, 298],
        ],
      },
      {
        remark: "表箱7开关 => 下方中间点",
        coords: [
          [1531, 250],
          [1531, 200],
        ],
      },
      {
        remark: "下方中间点 => 电表2上方",
        coords: [
          [1533, 200],
          [1503, 200],
        ],
      },
      {
        remark: "电表2上方 => 电表2",
        coords: [
          [1505, 200],
          [1505, 158],
        ],
      },
      {
        remark: "电表2上方 => 电表1上方",
        coords: [
          [1505, 200],
          [1439, 200],
        ],
      },
      {
        remark: "电表1上方 => 电表1",
        coords: [
          [1441, 200],
          [1441, 158],
        ],
      },
      {
        remark: "下方中间点 => 电表3上方",
        coords: [
          [1533, 200],
          [1565, 200],
        ],
      },
      {
        remark: "电表3上方 => 电表3",
        coords: [
          [1563, 200],
          [1563, 158],
        ],
      },
      {
        remark: "电表3上方 => 电表4上方",
        coords: [
          [1563, 200],
          [1635, 200],
        ],
      },
      {
        remark: "电表4上方 => 电表4",
        coords: [
          [1633, 200],
          [1633, 158],
        ],
      },
      //=============表箱7上方点 => 表箱8上方点 => 表箱8开关  =>电表连线 ==============================
      {
        remark: "表箱7上方点 => 表箱8上方点",
        coords: [
          [1531, 375],
          [1889, 375],
        ],
      },
      {
        remark: "表箱8上方点 => 表箱8开关",
        coords: [
          [1887, 375],
          [1887, 298],
        ],
      },
      {
        remark: "表箱8开关 => 下方中间点",
        coords: [
          [1887, 250],
          [1887, 200],
        ],
      },
      {
        remark: "下方中间点 => 电表2上方",
        coords: [
          [1887, 200],
          [1853, 200],
        ],
      },
      {
        remark: "电表2上方 => 电表2",
        coords: [
          [1855, 200],
          [1855, 158],
        ],
      },
      {
        remark: "电表2上方 => 电表1上方",
        coords: [
          [1855, 200],
          [1788, 200],
        ],
      },
      {
        remark: "电表1上方 => 电表1",
        coords: [
          [1790, 200],
          [1790, 158],
        ],
      },
      {
        remark: "下方中间点 => 电表3上方",
        coords: [
          [1887, 200],
          [1917, 200],
        ],
      },
      {
        remark: "电表3上方 => 电表3",
        coords: [
          [1917, 200],
          [1917, 158],
        ],
      },
      {
        remark: "电表3上方 => 电表4上方",
        coords: [
          [1917, 200],
          [1983, 200],
        ],
      },
      {
        remark: "电表4上方 => 电表4",
        coords: [
          [1981, 200],
          [1981, 158],
        ],
      },
      //=============表箱8上方点 => 表箱9上方点 => 表箱9开关  =>电表连线 ==============================
      {
        remark: "表箱8上方点 => 表箱9上方点",
        coords: [
          [1887, 375],
          [2235, 375],
        ],
      },
      {
        remark: "表箱9上方点 => 表箱9开关",
        coords: [
          [2233, 375],
          [2233, 298],
        ],
      },
      {
        remark: "表箱9开关 => 下方中间点",
        coords: [
          [2233, 250],
          [2233, 200],
        ],
      },
      {
        remark: "下方中间点 => 电表2上方",
        coords: [
          [2233, 200],
          [2200, 200],
        ],
      },
      {
        remark: "电表2上方 => 电表2",
        coords: [
          [2202, 200],
          [2202, 158],
        ],
      },
      {
        remark: "电表2上方 => 电表1上方",
        coords: [
          [2205, 200],
          [2133, 200],
        ],
      },
      {
        remark: "电表1上方 => 电表1",
        coords: [
          [2135, 200],
          [2135, 158],
        ],
      },
      {
        remark: "下方中间点 => 电表3上方",
        coords: [
          [2233, 200],
          [2267, 200],
        ],
      },
      {
        remark: "电表3上方 => 电表3",
        coords: [
          [2265, 200],
          [2265, 158],
        ],
      },
      {
        remark: "电表3上方 => 电表4上方",
        coords: [
          [2267, 200],
          [2330, 200],
        ],
      },
      {
        remark: "电表4上方 => 电表4",
        coords: [
          [2328, 200],
          [2328, 158],
        ],
      },
      //===========电表详情连线======================
      {
        remark: "大电表下方 => 下方点",
        coords: [
          [2610, 435],
          [2610, 400],
        ],
      },
      {
        remark: "大电表下方点 => 空调上方点",
        coords: [
          [2608, 400],
          [2864, 400],
        ],
      },
      {
        remark: "空调上方点 => 空调",
        coords: [
          [2862, 400],
          [2862, 370],
        ],
      },
    ],
  };
  const options = {
    grid: {
      top: 0,
      left: 0,
      right: 0,
      bottom: 0,
    },
    animationEasingUpdate: "quinticOut",
    animationDurationUpdate: 100,
    layout: "force",
    xAxis: {
      min: 0,
      max: 3500,
      show: false,
      type: "value",
    },
    yAxis: {
      min: 0,
      max: 1200,
      show: false,
      type: "value",
    },
    series: [
      {
        type: "graph",
        coordinateSystem: "cartesian2d",
        focusNodeAdjacency: false,
        hoverAnimation: false,
        label: {
          normal: {
            show: true,
            position: "right",
            color: "#fff",
          },
        },
        data: charts.nodes,
      },
      {
        type: "lines",
        polyline: true,
        coordinateSystem: "cartesian2d",
        lineStyle: {
          normal: {
            color: "lightgray", //线颜色
            width: 5, //线宽度
            opacity: 1,
            curveness: 0,
          },
        },
        data: charts.linesData,
      },
    ],
  };
  let mychart = echarts.init(document.getElementById("chart"));
  mychart.setOption(options);
}
initData();
