function initData() {
  const charts = {
    linesData: [
      //===========表箱1和3中间点和表箱2连接线=========
      {
        remark: "表箱2上方点 => 表箱1和表箱3中间点",
        coords: [
          [368, 750],
          [718, 750],
        ],
      },
      {
        remark: "表箱2上方点 => 表箱2竖线",
        coords: [
          [370, 750],
          [370, 660],
        ],
      },

      //==============表箱1-3中间点 和表箱3连接线==================
      {
        remark: "表箱1和表箱3中间 => 表箱3开关",
        coords: [
          [718, 750],
          [718, 660],
        ],
      },
      {
        remark: "表箱1和表箱3中间 => 表箱1开关",
        coords: [
          [718, 750],
          [718, 835],
        ],
      },
      //====================分支开关1接表箱1、2、3=============
      {
        remark: "表箱1和表箱3中间 => 表箱3和低压分支箱上方中间点",
        coords: [
          [718, 750],
          [902, 750],
        ],
      },
      {
        remark: "表箱3和低压分支箱上方中间点 => 表箱3和低压分支箱下方中间点",
        coords: [
          [900, 750],
          [900, 408],
        ],
      },
      {
        remark: "表箱3和低压分支箱下方中间点 => 分支开关1下方点",
        coords: [
          [900, 408],
          [1070, 408],
        ],
      },
      {
        remark: "分支开关1下方点 => 分支开关1",
        coords: [
          [1070, 408],
          [1070, 490],
        ],
      },
      //====================分支开关4接表箱10、11、12=============
      {
        remark: "表箱11和低压分支箱上方中间点  =>  表箱10和表箱11中间 ",
        coords: [
          [1680, 750],
          [1888, 750],
        ],
      },
      {
        remark: "表箱10和表箱11中间  =>  表箱11开关 ",
        coords: [
          [1888, 750],
          [1888, 663],
        ],
      },
      {
        remark: "表箱10和表箱11中间  =>  表箱10开关 ",
        coords: [
          [1888, 750],
          [1888, 835],
        ],
      },
      {
        remark: "表箱10和表箱11中间  =>  表箱12上方点 ",
        coords: [
          [1888, 750],
          [2238, 750],
        ],
      },
      {
        remark: "表箱12上方点  =>  表箱12开关 ",
        coords: [
          [2235, 750],
          [2235, 663],
        ],
      },
      {
        remark:
          "表箱11和低压分支箱上方中间点 => 表箱11和低压分支箱下方方中间点",
        coords: [
          [1680, 750],
          [1680, 408],
        ],
      },
      {
        remark: "表箱11和低压分支箱下方中间点 => 分支开关4下方点",
        coords: [
          [1680, 408],
          [1560, 408],
        ],
      },
      {
        remark: "分支开关4下方点 => 分支开关4",
        coords: [
          [1560, 408],
          [1560, 490],
        ],
      },
      //============低压分支箱连线===============
      {
        remark: "分支开关1 => 开关1上方点",
        coords: [
          [1070, 535],
          [1070, 615],
        ],
      },
      {
        remark: "分支开关2上方点 => 分支开关2",
        coords: [
          [1232, 615],
          [1232, 535],
        ],
      },
      {
        remark: "分支开关3 => 开关3上方点",
        coords: [
          [1398, 535],
          [1398, 615],
        ],
      },
      {
        remark: "分支开关4 => 开关4上方点",
        coords: [
          [1560, 535],
          [1560, 615],
        ],
      },
      {
        remark: "开关1上方点 => 开关4上方点",
        coords: [
          [1068, 615],
          [1562, 615],
        ],
      },
      {
        remark: "分支开关中间点 => 总开关",
        coords: [
          [1306, 615],
          [1306, 673],
        ],
      },
      {
        remark: "分支开关2 => 下方点",
        coords: [
          [1232, 490],
          [1232, 375],
        ],
      },
      {
        remark: "分支开关3 => 下方点",
        coords: [
          [1398, 488],
          [1398, 375],
        ],
      },
      //=================低压配电室======================
      {
        remark: "分支总开关 => 低压配电室开关",
        coords: [
          [1306, 720],
          [1306, 905],
        ],
      },
      //==============表箱1连接线=================
      {
        remark: "表箱1开关 => 上方点",
        coords: [
          [718, 880],
          [718, 895],
        ],
      },
      {
        remark: "电表5下方 => 电表8下方",
        coords: [
          [618, 895],
          [818, 895],
        ],
      },
      {
        remark: "电表5下方 => 电表5",
        coords: [
          [620, 895],
          [620, 910],
        ],
      },
      {
        remark: "电表6下方 => 电表6",
        coords: [
          [690, 895],
          [690, 910],
        ],
      },
      {
        remark: "电表7下方 => 电表7",
        coords: [
          [746, 895],
          [746, 910],
        ],
      },
      {
        remark: "电表8下方 => 电表8",
        coords: [
          [816, 895],
          [816, 910],
        ],
      },
      {
        remark: "电表5上方 => 电表1下方",
        coords: [
          [620, 977],
          [620, 997],
        ],
      },
      {
        remark: "电表6上方 => 电表2下方",
        coords: [
          [690, 977],
          [690, 997],
        ],
      },
      {
        remark: "电表7上方 => 电表3下方",
        coords: [
          [746, 977],
          [746, 997],
        ],
      },
      {
        remark: "电表8上方 => 电表4下方",
        coords: [
          [816, 977],
          [816, 997],
        ],
      },
      //====================表箱2连线==============================
      {
        remark: "表箱2开关 => 下方中间点",
        coords: [
          [370, 618],
          [370, 595],
        ],
      },
      {
        remark: "电表1上方 => 电表4上方",
        coords: [
          [266, 595],
          [470, 595],
        ],
      },
      {
        remark: "电表1上方 => 电表1",
        coords: [
          [268, 595],
          [268, 572],
        ],
      },
      {
        remark: "电表2上方 => 电表2",
        coords: [
          [335, 595],
          [335, 572],
        ],
      },
      {
        remark: "电表3上方 => 电表3",
        coords: [
          [398, 595],
          [398, 572],
        ],
      },
      {
        remark: "电表4上方 => 电表4",
        coords: [
          [468, 595],
          [468, 572],
        ],
      },
      {
        remark: "电表1下方 => 电表5上方",
        coords: [
          [268, 505],
          [268, 485],
        ],
      },
      {
        remark: "电表2下方 => 电表6上方",
        coords: [
          [335, 505],
          [335, 485],
        ],
      },
      {
        remark: "电表3下方 => 电表7上方",
        coords: [
          [398, 505],
          [398, 485],
        ],
      },
      {
        remark: "电表4下方 => 电表8上方",
        coords: [
          [468, 505],
          [468, 485],
        ],
      },
      //==========================表箱3连线========================================
      {
        remark: "表箱3开关 => 下方中间点",
        coords: [
          [718, 618],
          [718, 595],
        ],
      },
      {
        remark: "电表1上方 => 电表4上方",
        coords: [
          [618, 595],
          [818, 595],
        ],
      },
      {
        remark: "电表1上方 => 电表1",
        coords: [
          [620, 595],
          [620, 572],
        ],
      },
      {
        remark: "电表2上方 => 电表2",
        coords: [
          [683, 595],
          [683, 572],
        ],
      },
      {
        remark: "电表3上方 => 电表3",
        coords: [
          [746, 595],
          [746, 572],
        ],
      },
      {
        remark: "电表4上方 => 电表4",
        coords: [
          [816, 595],
          [816, 572],
        ],
      },
      {
        remark: "电表1下方 => 电表5上方",
        coords: [
          [620, 505],
          [620, 485],
        ],
      },
      {
        remark: "电表2下方 => 电表6上方",
        coords: [
          [683, 505],
          [683, 485],
        ],
      },
      {
        remark: "电表3下方 => 电表7上方",
        coords: [
          [746, 505],
          [746, 485],
        ],
      },
      {
        remark: "电表4下方 => 电表8上方",
        coords: [
          [816, 505],
          [816, 485],
        ],
      },
      //=============分支开关2下方点 => 表箱6上方点 => 表箱6开关 =>电表连线==============================
      {
        remark: "分支开关2下方点 => 表箱6上方点",
        coords: [
          [1234, 375],
          [1063, 375],
        ],
      },
      {
        remark: "表箱6上方点 => 表箱6开关",
        coords: [
          [1065, 375],
          [1065, 298],
        ],
      },
      {
        remark: "表箱6开关 => 下方中间点",
        coords: [
          [1065, 250],
          [1065, 225],
        ],
      },
      {
        remark: "电表1上方 => 电表4上方",
        coords: [
          [963, 225],
          [1163, 225],
        ],
      },
      {
        remark: "电表1上方 => 电表1",
        coords: [
          [965, 225],
          [965, 200],
        ],
      },
      {
        remark: "电表2上方 => 电表2",
        coords: [
          [1030, 225],
          [1030, 200],
        ],
      },
      {
        remark: "电表3上方 => 电表3",
        coords: [
          [1094, 225],
          [1094, 200],
        ],
      },
      {
        remark: "电表4上方 => 电表4",
        coords: [
          [1161, 225],
          [1161, 200],
        ],
      },
      {
        remark: "电表1下方 => 电表5上方",
        coords: [
          [965, 135],
          [965, 115],
        ],
      },
      {
        remark: "电表2下方 => 电表6上方",
        coords: [
          [1030, 135],
          [1030, 115],
        ],
      },
      {
        remark: "电表3下方 => 电表7上方",
        coords: [
          [1094, 135],
          [1094, 115],
        ],
      },
      {
        remark: "电表4下方 => 电表8上方",
        coords: [
          [1161, 135],
          [1161, 115],
        ],
      },
      //=============表箱6上方点 => 表箱5上方点 => 表箱5开关 => 电表连线==============================
      {
        remark: "表箱6上方点 => 表箱5上方点",
        coords: [
          [1063, 375],
          [717, 375],
        ],
      },
      {
        remark: "表箱5上方点 => 表箱5开关",
        coords: [
          [719, 375],
          [719, 298],
        ],
      },
      {
        remark: "表箱5开关 => 下方中间点",
        coords: [
          [719, 250],
          [719, 225],
        ],
      },
      {
        remark: "电表1上方 => 电表4上方",
        coords: [
          [620, 225],
          [815, 225],
        ],
      },
      {
        remark: "电表1上方 => 电表1",
        coords: [
          [622, 225],
          [622, 200],
        ],
      },
      {
        remark: "电表2上方 => 电表2",
        coords: [
          [685, 225],
          [685, 200],
        ],
      },
      {
        remark: "电表3上方 => 电表3",
        coords: [
          [748, 225],
          [748, 200],
        ],
      },
      {
        remark: "电表4上方 => 电表4",
        coords: [
          [813, 225],
          [813, 200],
        ],
      },
      {
        remark: "电表1下方 => 电表5上方",
        coords: [
          [622, 135],
          [622, 115],
        ],
      },
      {
        remark: "电表2下方 => 电表6上方",
        coords: [
          [685, 135],
          [685, 115],
        ],
      },
      {
        remark: "电表3下方 => 电表7上方",
        coords: [
          [748, 135],
          [748, 115],
        ],
      },
      {
        remark: "电表4下方 => 电表8上方",
        coords: [
          [813, 135],
          [813, 115],
        ],
      },
      //=============表箱5上方点 => 表箱4上方点 => 表箱4开关==============================
      {
        remark: "表箱5上方点 => 表箱4上方点",
        coords: [
          [717, 375],
          [368, 375],
        ],
      },
      {
        remark: "表箱4上方点 => 表箱4开关",
        coords: [
          [370, 375],
          [370, 298],
        ],
      },
      {
        remark: "表箱4开关 => 下方中间点",
        coords: [
          [370, 250],
          [370, 225],
        ],
      },
      {
        remark: "电表1上方 => 电表4上方",
        coords: [
          [271, 225],
          [467, 225],
        ],
      },
      {
        remark: "电表1上方 => 电表1",
        coords: [
          [273, 225],
          [273, 200],
        ],
      },
      {
        remark: "电表2上方 => 电表2",
        coords: [
          [335, 225],
          [335, 200],
        ],
      },
      {
        remark: "电表3上方 => 电表3",
        coords: [
          [400, 225],
          [400, 200],
        ],
      },
      {
        remark: "电表4上方 => 电表4",
        coords: [
          [465, 225],
          [465, 200],
        ],
      },
      {
        remark: "电表1下方 => 电表5上方",
        coords: [
          [273, 135],
          [273, 115],
        ],
      },
      {
        remark: "电表2下方 => 电表6上方",
        coords: [
          [335, 135],
          [335, 115],
        ],
      },
      {
        remark: "电表3下方 => 电表7上方",
        coords: [
          [400, 135],
          [400, 115],
        ],
      },
      {
        remark: "电表4下方 => 电表8上方",
        coords: [
          [465, 135],
          [465, 115],
        ],
      },
      //=============分支开关3下方点  => 表箱7开关 =>电表连线 ==============================
      {
        remark: "分支开关3下方点 => 表箱7上方点",
        coords: [
          [1396, 375],
          [1531, 375],
        ],
      },
      {
        remark: "分支开关3下方点 => 表箱7开关",
        coords: [
          [1531, 375],
          [1531, 298],
        ],
      },
      {
        remark: "表箱7开关 => 下方中间点",
        coords: [
          [1531, 250],
          [1531, 225],
        ],
      },
      {
        remark: "电表1上方 => 电表4上方",
        coords: [
          [1439, 225],
          [1635, 225],
        ],
      },
      {
        remark: "电表1上方 => 电表1",
        coords: [
          [1441, 225],
          [1441, 200],
        ],
      },
      {
        remark: "电表2上方 => 电表2",
        coords: [
          [1505, 225],
          [1505, 200],
        ],
      },
      {
        remark: "电表3上方 => 电表3",
        coords: [
          [1563, 225],
          [1563, 200],
        ],
      },
      {
        remark: "电表4上方 => 电表4",
        coords: [
          [1633, 225],
          [1633, 200],
        ],
      },
      {
        remark: "电表1下方 => 电表5上方",
        coords: [
          [1441, 135],
          [1441, 115],
        ],
      },
      {
        remark: "电表2下方 => 电表6上方",
        coords: [
          [1505, 135],
          [1505, 115],
        ],
      },
      {
        remark: "电表3下方 => 电表7上方",
        coords: [
          [1563, 135],
          [1563, 115],
        ],
      },
      {
        remark: "电表4下方 => 电表8上方",
        coords: [
          [1633, 135],
          [1633, 115],
        ],
      },
      //=============表箱7上方点 => 表箱8上方点 => 表箱8开关  =>电表连线 ==============================
      {
        remark: "表箱7上方点 => 表箱8上方点",
        coords: [
          [1531, 375],
          [1889, 375],
        ],
      },
      {
        remark: "表箱8上方点 => 表箱8开关",
        coords: [
          [1887, 375],
          [1887, 298],
        ],
      },
      {
        remark: "表箱8开关 => 下方中间点",
        coords: [
          [1887, 250],
          [1887, 225],
        ],
      },
      {
        remark: "电表1上方 => 电表4上方",
        coords: [
          [1788, 225],
          [1983, 225],
        ],
      },
      {
        remark: "电表1上方 => 电表1",
        coords: [
          [1790, 225],
          [1790, 200],
        ],
      },
      {
        remark: "电表2上方 => 电表2",
        coords: [
          [1855, 225],
          [1855, 200],
        ],
      },
      {
        remark: "电表3上方 => 电表3",
        coords: [
          [1917, 225],
          [1917, 200],
        ],
      },
      {
        remark: "电表4上方 => 电表4",
        coords: [
          [1981, 225],
          [1981, 200],
        ],
      },
      {
        remark: "电表1下方 => 电表5上方",
        coords: [
          [1790, 135],
          [1790, 115],
        ],
      },
      {
        remark: "电表2下方 => 电表6上方",
        coords: [
          [1855, 135],
          [1855, 115],
        ],
      },
      {
        remark: "电表3下方 => 电表7上方",
        coords: [
          [1917, 135],
          [1917, 115],
        ],
      },
      {
        remark: "电表4下方 => 电表8上方",
        coords: [
          [1981, 135],
          [1981, 115],
        ],
      },
      //=============表箱8上方点 => 表箱9上方点 => 表箱9开关  =>电表连线 ==============================
      {
        remark: "表箱8上方点 => 表箱9上方点",
        coords: [
          [1887, 375],
          [2235, 375],
        ],
      },
      {
        remark: "表箱9上方点 => 表箱9开关",
        coords: [
          [2233, 375],
          [2233, 298],
        ],
      },
      {
        remark: "表箱9开关 => 下方中间点",
        coords: [
          [2233, 250],
          [2233, 225],
        ],
      },
      {
        remark: "电表1上方 => 电表4上方",
        coords: [
          [2133, 225],
          [2330, 225],
        ],
      },
      {
        remark: "电表1上方 => 电表1",
        coords: [
          [2135, 225],
          [2135, 200],
        ],
      },
      {
        remark: "电表2上方 => 电表2",
        coords: [
          [2202, 225],
          [2202, 200],
        ],
      },
      {
        remark: "电表3上方 => 电表3",
        coords: [
          [2265, 225],
          [2265, 200],
        ],
      },
      {
        remark: "电表4上方 => 电表4",
        coords: [
          [2328, 225],
          [2328, 200],
        ],
      },
      {
        remark: "电表1下方 => 电表5上方",
        coords: [
          [2135, 135],
          [2135, 115],
        ],
      },
      {
        remark: "电表2下方 => 电表6上方",
        coords: [
          [2202, 135],
          [2202, 115],
        ],
      },
      {
        remark: "电表3下方 => 电表7上方",
        coords: [
          [2265, 135],
          [2265, 115],
        ],
      },
      {
        remark: "电表4下方 => 电表8上方",
        coords: [
          [2328, 135],
          [2328, 115],
        ],
      },
      //==============表箱10 连接线=================
      {
        remark: "表箱10开关 => 上方点",
        coords: [
          [1888, 880],
          [1888, 895],
        ],
      },
      {
        remark: "电表5下方 => 电表8下方",
        coords: [
          [1786, 895],
          [1982, 895],
        ],
      },
      {
        remark: "电表5下方 => 电表5",
        coords: [
          [1788, 895],
          [1788, 910],
        ],
      },
      {
        remark: "电表6下方 => 电表6",
        coords: [
          [1855, 895],
          [1855, 910],
        ],
      },
      {
        remark: "电表7下方 => 电表7",
        coords: [
          [1915, 895],
          [1915, 910],
        ],
      },
      {
        remark: "电表8下方 => 电表8",
        coords: [
          [1980, 895],
          [1980, 910],
        ],
      },
      {
        remark: "电表5上方 => 电表1下方",
        coords: [
          [1788, 977],
          [1788, 997],
        ],
      },
      {
        remark: "电表6上方 => 电表2下方",
        coords: [
          [1855, 977],
          [1855, 997],
        ],
      },
      {
        remark: "电表7上方 => 电表3下方",
        coords: [
          [1915, 977],
          [1915, 997],
        ],
      },
      {
        remark: "电表8上方 => 电表4下方",
        coords: [
          [1980, 977],
          [1980, 997],
        ],
      },
      //==========================表箱11连线========================================
      {
        remark: "表箱11开关 => 下方中间点",
        coords: [
          [1888, 618],
          [1888, 595],
        ],
      },
      {
        remark: "电表1上方 => 电表4上方",
        coords: [
          [1786, 595],
          [1982, 595],
        ],
      },
      {
        remark: "电表1上方 => 电表1",
        coords: [
          [1788, 595],
          [1788, 572],
        ],
      },
      {
        remark: "电表2上方 => 电表2",
        coords: [
          [1855, 595],
          [1855, 572],
        ],
      },
      {
        remark: "电表3上方 => 电表3",
        coords: [
          [1915, 595],
          [1915, 572],
        ],
      },
      {
        remark: "电表4上方 => 电表4",
        coords: [
          [1980, 595],
          [1980, 572],
        ],
      },
      {
        remark: "电表1下方 => 电表5上方",
        coords: [
          [1788, 505],
          [1788, 485],
        ],
      },
      {
        remark: "电表2下方 => 电表6上方",
        coords: [
          [1855, 505],
          [1855, 485],
        ],
      },
      {
        remark: "电表3下方 => 电表7上方",
        coords: [
          [1915, 505],
          [1915, 485],
        ],
      },
      {
        remark: "电表4下方 => 电表8上方",
        coords: [
          [1980, 505],
          [1980, 485],
        ],
      },
      //==========================表箱12连线========================================
      {
        remark: "表箱12开关 => 下方中间点",
        coords: [
          [2238, 618],
          [2238, 595],
        ],
      },
      {
        remark: "电表1上方 => 电表4上方",
        coords: [
          [2136, 595],
          [2332, 595],
        ],
      },
      {
        remark: "电表1上方 => 电表1",
        coords: [
          [2138, 595],
          [2138, 572],
        ],
      },
      {
        remark: "电表2上方 => 电表2",
        coords: [
          [2205, 595],
          [2205, 572],
        ],
      },
      {
        remark: "电表3上方 => 电表3",
        coords: [
          [2265, 595],
          [2265, 572],
        ],
      },
      {
        remark: "电表4上方 => 电表4",
        coords: [
          [2330, 595],
          [2330, 572],
        ],
      },
      {
        remark: "电表1下方 => 电表5上方",
        coords: [
          [2138, 505],
          [2138, 485],
        ],
      },
      {
        remark: "电表2下方 => 电表6上方",
        coords: [
          [2205, 505],
          [2205, 485],
        ],
      },
      {
        remark: "电表3下方 => 电表7上方",
        coords: [
          [2265, 505],
          [2265, 485],
        ],
      },
      {
        remark: "电表4下方 => 电表8上方",
        coords: [
          [2330, 505],
          [2330, 485],
        ],
      },
      //===========电表详情连线======================
      {
        remark: "大电表下方 => 下方点",
        coords: [
          [2610, 435],
          [2610, 400],
        ],
      },
      {
        remark: "大电表下方点 => 空调上方点",
        coords: [
          [2610, 400],
          [2610, 355],
        ],
      },
      {
        remark: "大电表下方点 => 热水器上方点",
        coords: [
          [2608, 400],
          [2864, 400],
        ],
      },
      {
        remark: "空调上方点 => 空调",
        coords: [
          [2862, 400],
          [2862, 355],
        ],
      },
      {
        remark: "空调上方点 => 冰箱上方点",
        coords: [
          [2862, 400],
          [3104, 400],
        ],
      },
      {
        remark: "冰箱上方点 => 冰箱",
        coords: [
          [3102, 400],
          [3102, 355],
        ],
      },
    ],
  };
  const options = {
    grid: {
      top: 0,
      left: 0,
      right: 0,
      bottom: 0,
    },
    animationEasingUpdate: "quinticOut",
    animationDurationUpdate: 100,
    layout: "force",
    xAxis: {
      min: 0,
      max: 3500,
      show: false,
      type: "value",
    },
    yAxis: {
      min: 0,
      max: 1200,
      show: false,
      type: "value",
    },
    series: [
      {
        type: "graph",
        coordinateSystem: "cartesian2d",
        focusNodeAdjacency: false,
        hoverAnimation: false,
        label: {
          normal: {
            show: true,
            position: "right",
            color: "#fff",
          },
        },
        data: charts.nodes,
      },
      {
        type: "lines",
        polyline: true,
        coordinateSystem: "cartesian2d",
        lineStyle: {
          normal: {
            color: "lightgray", //线颜色
            width: 5, //线宽度
            opacity: 1,
            curveness: 0,
          },
        },
        data: charts.linesData,
      },
    ],
  };
  let mychart = echarts.init(document.getElementById("chart"));
  mychart.setOption(options);
}
initData();
